Revit 2020 API
AdvancedTransparent Members
The AdvancedTransparent type exposes the following members.
Properties
Name | Description
SurfaceAlbedo
 The property labeled "Color" from the "PrismTransparent" schema.
SurfaceAnisotropy
 The property labeled "Anisotropy" from the "PrismTransparent" schema.
SurfaceCutout
 The property labeled "Image" from the "PrismTransparent" schema.
SurfaceNdfType
 The property labeled "NDF" from the "PrismTransparent" schema.
SurfaceNormal
 The property labeled "Image" from the "PrismTransparent" schema.
SurfaceRotation
 The property labeled "Rotation" from the "PrismTransparent" schema.
SurfaceRoughness
 The property labeled "Roughness" from the "PrismTransparent" schema.
TransparentColor
 The property labeled "Color" from the "PrismTransparent" schema.
TransparentDistance
 The property labeled "Transparent Distance" from the "PrismTransparent" schema.
TransparentIor
 The property labeled "IOR" from the "PrismTransparent" schema.
See Also
AdvancedTransparent Class
Autodesk.Revit.DB.Visual Namespace